title: DNS Slow Response Detection
id: 
status: experimental
description: Detect unusually slow DNS responses from pfSense or Corelight
logsource:
  product: zeek
  service: dns 
detection: 
  selection:
    query_time|gte: 1000
  condition: selection
fields:
  - id.orig_h
  - id.resp_h
  - qtype_name
  - rtt
falsepositives:
  - High load on DNS resolver
level: medium
